[
{
"json_featuretype":"NewFeatureType"
,"Note":"driver for American Expediting advised that this is the 3rd time that he has requested a signed BOL and they refuse - they tell the driver that they just note it in their computer - may be an issue for some customers - just an FYI"
,"Number":55622
,"Name":"CANRIG DRILLING TECHNOLOGIES LTD"
,"SalesId":"BRRO"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"Dave, this is a new Butler in Salinas, CA I am doing a H/S for Jason may want to look into them and get them set up--Denise(SLC)"
,"Number":329690
,"Name":"BUTLER MACHINERY"
,"SalesId":"DAWS"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"Cons builds gas plants. I spoke to the receptionis who refered me to John Loschke. she said that they are based out of Roosevelt, UT 435-722-8280 and that they were purchased by Wyatt out of OK last year. There are what look like construcion sites in our database."
,"Number":299604
,"Name":"R J TAYLOR"
,"SalesId":"MICO"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"Just delivered his tractor part. All new customer, I had to enter the basic info, Wendy ran a credit check and they came back approved. Thanks BRBI"
,"Number":293080
,"Name":"CONCORDIA TRACTOR INC"
,"SalesId":"TRGA"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"this guy said that you called on him - first shipment"
,"Number":295689
,"Name":"TP PUMP AND PIPE COMPANY"
,"SalesId":"MICO"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"Hey Paul,\r\nThis is a new location that has only been open since June. Bill Romeo is the contact I spoke with (very nice guy). They are paying for 1111A1171 so I thought it would be a good time to get in there.\r\nJeremy"
,"Number":294623
,"Name":"WILSON SUPPLY"
,"SalesId":"PALE"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"Tracking # 1202A1645 is being paid by Kaman just because P J Food Services did not have an account with us. P J is paying Kaman for the freight and it sounds like they have a definite need for us. Robert is a good contact at the shipper to talk to."
,"Number":299032
,"Name":"P J FOOD SERVICES"
,"SalesId":"DAWS"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"The Pacificorp Hunter Power Plant located in Castledale, UT. will be starting a four week turnaround. The turnaround will start on 02/25/12 and is scheduled to end on  03/24/12 and could last longer if necessary. My main contact at the plant is Senior Buyer Lorinda Quick, and is a good contact for anyone handling a shipment during the turnaround."
,"Number":3224
,"Name":"HUNTER POWER STATION PACIFICORP"
,"SalesId":"PALE"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"looks like this place is reopening??? - had drivers deliver large gaskets from Houston - he was advised that they were putting about 30 million into the facility - updated contact and phone (i think personal CELL number) - RITA"
,"Number":3129
,"Name":"TUSCARORA GOLD MINE"
,"SalesId":"PALE"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"Sean calls to set up shipments and has to use Wasatch pipeline in SLC to set up because he is unknown. We need to get them TSA approved.\r\n\r\nThanks"
,"Number":324505
,"Name":"PIPELINE SUPPLY AND SERVICE"
,"SalesId":"RODV"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"changed address to correct one - shipper advised that they had not been on Gayle rd for a couple years"
,"Number":49493
,"Name":"ACTEK"
,"SalesId":"RODV"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"ed was super happy about a previous shipment we completed for him.  He has a few customer that do need emergency shipments done.  He was also impress with the speed of quoting we did and the level of service we proved I did fill ghimin on a lot of what we do.  I think he will do a good hanful of shipments with us.  I informed him ill be sending his info over to you and you would set him up in \"the system\" get a laminate card and such.  happy hunting :)"
,"Number":289920
,"Name":"PRECISION FORGING DIES"
,"SalesId":"TIKO"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"updated mailing address - discussed with JR at their facility - he was happy with the service"
,"Number":63913
,"Name":"CRAIG TAYLOR EQUIPMENT CO"
,"SalesId":"REPF"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"Please go by and see James. I quoted him a large project move that may move in the next few months.  See 1310B1887"
,"Number":46131
,"Name":"PREFERRED PUMP"
,"SalesId":"DAWS"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"please follow with Doris, see if they have any use for us 204-784-7611"
,"Number":298134
,"Name":"PRITCHARD METAL FAB"
,"SalesId":"PERI"
}
,{
"json_featuretype":"NewFeatureType"
,"Note":"Hi Traci - I hope your move went well!  NCRA has a shipment out of Mexico, and they purchased 2 pumps from Sulzer Pumps.  The group they purchased from is Sulzer Pumps in Tulsa.  I noticed this wasn't in our system so thought it may be a lead....I haven't talked to them personally, but have a number and figured it couldn't hurt!  \r\n\r\nThanks!\r\n\r\nBrian T"
,"Number":327284
,"Name":"SULZER PUMPS (US) INC."
,"SalesId":"TRLI"
}
]